#ifndef __RS485_H
#define __RS485_H

#include "SWM341.h"
#include "CircleBuffer.h"

/*---------------UART2_RX_TX_PORT----------------*/
#define RS485_TX_PORT                  PORTB
#define RS485_TX_PIN				   PIN11

#define RS485_RX_PORT				   PORTB
#define RS485_RX_PIN				   PIN13



void uart2_init(void);
bool get_uart2_msgStatus(void);
void clear_uart2_msgStatus(void);
/****************************************************************************************************************************************** 
* 函数名称:	uart2_sendByte()
* 功能说明:	发送一个字节的数据
* 输    入: uint8_t data			要发送的字节	
* 输    出: 
* 注意事项: 无
******************************************************************************************************************************************/
void uart2_sendByte(uint8_t data);
/****************************************************************************************************************************************** 
* 函数名称:	uart2_sendBytes()
* 功能说明:	发送指定字节的数据
* 输    入: uint8_t data			要发送的数据
		   uint16_t Size		要发送的数据长度
* 输    出: 
* 注意事项: 无
******************************************************************************************************************************************/
void uart2_sendBytes(uint8_t *pData, uint16_t Size);
















#endif

